---
kind: method
id: M:Autodesk.Revit.DB.ExternalGeometryId.Dispose
source: html/167fa49a-cad0-f157-231e-0110f2560a75.htm
---
# Autodesk.Revit.DB.ExternalGeometryId.Dispose Method

Releases all resources used by the ExternalGeometryId

## Syntax (C#)
```csharp
public void Dispose()
```